In [1]:
import numpy as np
import pandas as pd

# Q1

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

# HEAD

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# TAIL

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# DESCRIBE

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# LOC

In [6]:
df.loc[0:2,['PassengerId','Survived','Pclass']]

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3

# ILOC

In [8]:
df.iloc[0:2,[0,1,2]]

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1

# Q2

In [9]:
data = {'A': ['Tom', 'nick', 'krish', 'jack','Anup'],
        'B': [20, 21, 19, 18,34],
         'C':['India','China','Bnagladesh','Sri_Lanka','Pakistan']}

In [10]:
df1 = pd.DataFrame(data)

In [11]:
df1.head()

       A   B           C
0    Tom  20       India
1   nick  21       China
2  krish  19  Bnagladesh
3   jack  18   Sri_Lanka
4   Anup  34    Pakistan

In [12]:
df1.index = np.arange(1,len(df1)+1)

In [13]:
df1

       A   B           C
1    Tom  20       India
2   nick  21       China
3  krish  19  Bnagladesh
4   jack  18   Sri_Lanka
5   Anup  34    Pakistan

# Q3

In [14]:
data1 = {'Values': [10,20,30,40,50]}

In [15]:
df2 = pd.DataFrame(data1)

In [16]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [17]:
print((df2.iloc[0:3]).sum())

Values    60
dtype: int64

# Q4

In [18]:
data2 = {'Text': ['Delhi','Faridabad','Kolkata','Bengaluru']}

In [19]:
df3 = pd.DataFrame(data2)

In [20]:
df3

        Text
0      Delhi
1  Faridabad
2    Kolkata
3  Bengaluru

In [21]:
df3['Word_Count'] = df3['Text'].str.len()

In [22]:
df3

        Text  Word_Count
0      Delhi           5
1  Faridabad           9
2    Kolkata           7
3  Bengaluru           9

# Q5

In [49]:
# The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. 
# Otherwise, return the number of rows times the number of columns if DataFrame.

In [ ]:
# The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

# Q6

In [ ]:
# To read a excel file pd.read_csv

# Q7

In [23]:
data3 = {'Email': ["dipeshy98@gmail.com","abhuwan89@gmail.com","anup78@gmail.com","karan45@gmail.com"]}

In [24]:
df4 = pd.DataFrame(data3)

In [25]:
df4

                 Email
0  dipeshy98@gmail.com
1  abhuwan89@gmail.com
2     anup78@gmail.com
3    karan45@gmail.com

In [26]:
df4['Username'] = df4['Email'].str.split('@').str[0]

In [27]:
df4

                 Email   Username
0  dipeshy98@gmail.com  dipeshy98
1  abhuwan89@gmail.com  abhuwan89
2     anup78@gmail.com     anup78
3    karan45@gmail.com    karan45

# Q8

In [29]:
data4 = {'A': [3,8,6,2,9],
        'B': [5,2,9,3,1],
         'C':[1,7,4,5,2]}

In [30]:
df4 = pd.DataFrame(data4, columns = ['A', 'B', 'C'])

In [31]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [32]:
df5 = df4[(df4['A']>5) & (df4['B']<10)]

In [33]:
df5

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9

In [34]:
data5 = {'Values': [1,2,3,4,5,6,7,8,9,10]}

In [35]:
df6 = pd.DataFrame(data5,columns = ['Values'])

In [36]:
df6

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [37]:
df6.mean()

Values    5.5
dtype: float64

In [38]:
df6.mode()

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [39]:
df6.median()

Values    5.5
dtype: float64

# Q10

In [48]:
dates = pd.date_range(start='1/1/2023', end='1/31/2023', freq='D')
sales = [100, 105, 110, 115, 120, 118, 116, 114, 112, 115,
                  117, 119, 121, 120, 118, 116, 114, 112, 110, 108,
                  106, 107, 109, 111, 113, 115, 117, 119, 121, 123,128]
df = pd.DataFrame({'sales':sales}, index=dates)
sma = df['sales'].rolling(window=7).mean()
print(df.join(sma, rsuffix='_SMA'))

            sales   sales_SMA
2023-01-01    100         NaN
2023-01-02    105         NaN
2023-01-03    110         NaN
2023-01-04    115         NaN
2023-01-05    120         NaN
2023-01-06    118         NaN
2023-01-07    116  112.000000
2023-01-08    114  114.000000
2023-01-09    112  115.000000
2023-01-10    115  115.714286
2023-01-11    117  116.000000
2023-01-12    119  115.857143
2023-01-13    121  116.285714
2023-01-14    120  116.857143
2023-01-15    118  117.428571
2023-01-16    116  118.000000
2023-01-17    114  117.857143
2023-01-18    112  117.142857
2023-01-19    110  115.857143
2023-01-20    108  114.000000
2023-01-21    106  112.000000
2023-01-22    107  110.428571
2023-01-23    109  109.428571
2023-01-24    111  109.000000
2023-01-25    113  109.142857
2023-01-26    115  109.857143
2023-01-27    117  111.142857
2023-01-28    119  113.000000
2023-01-29    121  115.000000
2023-01-30    123  117.000000
2023-01-31    128  119.428571

# Q11

In [80]:
df = pd.DataFrame({'my_dates':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df['my_dates'] = pd.to_datetime(df['my_dates'])
df['day_of_week'] = df['my_dates'].dt.day_name()
df

    my_dates day_of_week
0 2023-01-01      Sunday
1 2023-01-02      Monday
2 2023-01-03     Tuesday
3 2023-01-04   Wednesday
4 2023-01-05    Thursday

In [88]:
df_date= pd.date_range(start='2023/01/01', end='2023/03/31', freq='D')

In [94]:
df = pd.DataFrame(df_date)

In [95]:
df.columns = ['date']

In [97]:
filtered_df = df.loc[(df['date'] >= '2023-01-01') & (df['date'] < '2023-01-31')]

In [98]:
filtered_df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

# Q12

In [ ]:
# Import pandas as pd

In [ ]:
# It should be imported for working on pandas